app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id", "sender") VALUES (?, ?, ?, ?, ?, ?)  [["title", "name"], ["description", "something new "], ["created_at", "2020-04-09 22:29:53.929729"], ["updated_at", "2020-04-09 22:29:53.929729"], ["user_id", 6], ["sender", "sender"]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save